In [5]:
import pandas as pd
india_weather = pd.DataFrame({
    "city" : ["mumbai","ahm","delhi"],
    "temprature" : [32,35,36],
    "humadity" : [60,40,65]
})
india_weather

     city  temprature  humadity
0  mumbai          32        60
1     ahm          35        40
2   delhi          36        65

In [6]:
canada_weather = pd.DataFrame({
    "city" : ["Toronto","London","Kitchner"],
    "temprature" : [10,9,8],
    "humadity" : [25,55,45]
})
canada_weather

       city  temprature  humadity
0   Toronto          10        25
1    London           9        55
2  Kitchner           8        45

In [8]:
df = pd.concat([canada_weather,india_weather],ignore_index=True)
df

       city  temprature  humadity
0   Toronto          10        25
1    London           9        55
2  Kitchner           8        45
3    mumbai          32        60
4       ahm          35        40
5     delhi          36        65

In [9]:
df = pd.concat([canada_weather,india_weather], keys=['canada','india'])
df

              city  temprature  humadity
canada 0   Toronto          10        25
       1    London           9        55
       2  Kitchner           8        45
india  0    mumbai          32        60
       1       ahm          35        40
       2     delhi          36        65

In [10]:
df.loc['canada']

       city  temprature  humadity
0   Toronto          10        25
1    London           9        55
2  Kitchner           8        45

In [14]:
tempratre_df = pd.DataFrame({
     "city" : ["mumbai","ahm","delhi"],
     "temprature" : [32,35,36]
})
tempratre_df

     city  temprature
0  mumbai          32
1     ahm          35
2   delhi          36

In [22]:
windspeed_df =  pd.DataFrame({
     "city" : ["ahm","delhi"],
     "windspeed" : [42,45]
}, index=[1,2])
windspeed_df

    city  windspeed
1    ahm         42
2  delhi         45

In [23]:
new_df=pd.concat([windspeed_df,tempratre_df], axis=1)
new_df

    city  windspeed    city  temprature
1    ahm       42.0     ahm          35
2  delhi       45.0   delhi          36
0    NaN        NaN  mumbai          32

In [25]:
s = pd.Series(["Rain","Humid","Sunny"],name="event")
s

0     Rain
1    Humid
2    Sunny
Name: event, dtype: object

In [26]:
df=pd.concat([tempratre_df, s],axis=1)
df

     city  temprature  event
0  mumbai          32   Rain
1     ahm          35  Humid
2   delhi          36  Sunny